{"rating": "5", "uuid": "734", "review_date": "2010-01-15", "helpful": "5", "reviewer_id": "A3LWC833HQIG7J", "not_helpful": "6", "review_text": "I didn't grow up in a family with a pressure cooker (PC), so really the only thing I knew or thought I knew was that they were dangerous, hard to use, something from the past. Boy could I not have been more wrong. I started thinking of getting one probably for the same reasons you are, the appeal of fast cooking, with tasty and healthy results, and improved safety over the pressure cookers from the past. My wife and I have had this model now for a couple of weeks and it delivers on all counts.The basic idea is that because of the pressure that builds up inside, water gets to 250 degrees, it is super hot. And at that temperature it can break down the tough parts of meats and cook things very quickly. Yet it also retains nutrients and tastes good. Well it does cook fast and it is tasty. I will take the experts opinion that it is also a healthy way to cook.As a PC newbee I had no idea what to expect. First off is a little bit of assembly. That went quickly and smoothly. Second is READING the instruction booklet. This is not a pan or a microwave or something like that. It is safe..but also something that is, well, under pressure. And pressure can be dangerous. After getting familiar with the parts of the pressure cooker we cooked our first meal, a pot roast. It was super easy and delicious. We used, frankly, a pretty cheap piece of meat but it came out tasting fantastic. It was quick but something to keep in mind is cooking time does not usually include the time to heat it up and the time to cool it down. Also you can't just walk away. Once the pressure seals the cooker most of the time you have to then reduce the heat. But it really isn't that much oversight.In any event even taking all of that into account it was still by far the fastest pot roast I have ever cooked and better than average in taste. We have done some chicken dishes and some rice dishes. It has turned out perfect rice in a fraction of the time it would have taken otherwise. We are still getting a feel for seasoning. Sometimes we have had dishes too seasoned and other times not but nothing that hasn't been easily as tasty as other ways we cook things.So if you are a PC newbee like me I say give it a try. As long as you read the instructions and respect the pressure it is a pretty easy way to cook with excellent tasty results in a quick amount of time. Granted it has only been a couple of weeks but we have eaten out much less these 2 weeks. We picked up a well regarded cookbook on AmazonPressure Perfect: Two Hour Taste in Twenty Minutes Using Your Pressure Cookerand so far so good. This could easily become the main way you cook, it has that a good a combination of benefits and realtive ease of use. What it excels at is...great results/unit of effort and time. I can't see many other ways that you can maximize your cooking effort and cooking time than a PC.", "summary": "Back to the future---great taste and healthy", "product_name": "Presto 01341 4-Quart Stainless Steel Pressure Cooker", "product_id": "B00002N602"}