{"rating": "5", "uuid": "474", "review_date": "2004-06-23", "helpful": "12", "reviewer_id": "A36EW68H08UOCS", "not_helpful": "12", "review_text": "The only bad thing about this ice cream maker is that it is so easy to use and the ice cream it makes is so delicious that you may find yourself making a fresh batch of ice cream a couple of times a week - and that may show up on your backside like it has mine!Seriously - with no ice or salt to mess with it is VERY easy to use.  The key to this maker is the cylinder which has walls filled with anti-freeze.  You put the cylinder into the freezer long enough to freeze it, then just put your favorite ice cream recipe into the turning cylinder and 20 minutes later you have ice cream heaven!  There's even an alarm that goes off a few minutes before the end that signals to you the time to add goodies - nuts, chocolate chips, fruit, or whatever you like.***ONE WORD OF WARNING ABOUT THE OPERATION***: If you do like I did and ignore the instructions you may be delayed in making your first batch:  You HAVE to start the machine (and turning the cylinder with the spatula inside) BEFORE you pour in your ice cream mix - if you DON'T the liquid will freeze in just a few seconds, locking the spatula (and the cylinder) in place, and when you go to start the machine - it won't.It is incredibly easy to clean as well - pretty much just the smooth-walled cylinder and the plastic spatula, then just put the cylinder back into the freezer and it's ready to make your NEXT batch.The texture of the ice cream that comes from this maker even seems smoother and \"ice creamier\" than what I've seen from any other variety of home-use ice cream machines.Great ice cream, easy to use, easy to clean - pretty doggone inexpensive.  If you have any inclination to make your own ice cream, this is the machine to have, in my humble opinion.", "summary": "This Ice Cream Maker is FANTASTIC!", "product_name": "Cuisinart ICE-20 Automatic 1-1/2-Quart Ice Cream Maker, White", "product_id": "B00000JGRT"}