{"rating": "5", "uuid": "556", "review_date": "2001-10-13", "helpful": "170", "reviewer_id": "A14ZT88C4HY6QR", "not_helpful": "181", "review_text": "When buying the Cuisinart ice cream maker, I really wasn't sure I'd use it, as I rarely eat ice creams.  The power to create is a heady experience, though, and the effortlessness with which wonderful concoctions can be made using this machine ensures it will not become one of those useless appliances collecting dust on a shelf somewhere.This is a great purchase even for those who assume they can't eat ice cream!  Since you control the ingredients, you can create recipes working around any sort of diet -- allergy, diabetic, lactose intolerant, vegan, whatever!  The machine also works equally well for sherberts and frozen drinks.  It's extremely easy to use and cleans very easily.Few notes for better results:1) The bowl must be *frozen*. I recommend at least 2 days in the freezer between uses (you may want a second bowl).2) Upon removing the bowl from the freezer, add ingredients and use -- it will start to thaw immediately.  A friend noted that covering the top of the unit while mixing causes it to retain its &quot;cool&quot; longer (a plate over the opening works well).3) The ingredients must be very cold.  If cooking ingredients (such as for fruit or egg enhanced recipes), it's absolutely necessary to chill the resulting mixture before adding it to the unit.4) Choice in ingredients can make or break your ice cream.  While milk can be used, cream results in a much richer, thicker, tastier ice cream.  Also, make sure you've crushed or finely chopped any solid ingredients before adding, as otherwise, they will clog in the mechanism; they should also be added during the last 5 minutes only or will impede freezing (same goes for alcohol).  Thorough mixing of ingredients is important, as well, since the machine does not churn the mixture (sugar especially needs to be well dissolved or will result in uneven flavoring).5) Regardless of what you do, you will produce very soft ice cream.  Pouring the result into a freezer-proof container and freezing for a few hours to one day works very well.I know that sounds like a lot of hassles, but it's really not.The preparation of ingredients can range from moments to hours, as your options are quite limitless.It makes 1.5 quarts of ice cream, which is not a limitation (should you feel you will consistently need more servings, invest in additional bowls). It stores very well, lasting for a couple of weeks without crystalizing.  I would use mine every day if I could remember to buy cream!", "summary": "My guilty pleasure...", "product_name": "Cuisinart ICE-20 Automatic 1-1/2-Quart Ice Cream Maker, White", "product_id": "B00000JGRT"}