{"rating": "4", "uuid": "751", "review_date": "2013-09-20", "helpful": "2", "reviewer_id": "A2IDRAYYZ5GKBZ", "not_helpful": "2", "review_text": "I remember a bit of a kitchen disaster during my childhood when the seal blew off my mother's pressure cooker.  Even after a thorough wipe down of cabinets and walls, we were still finding bits of broth and meat fat blown everywhere for the next few days.  I've lived in fear of them ever since, but finally decided to take a chance on one after reading that the models made after 1990 were much safer.I'm glad I changed my mind.  It's super for quickly making beans and brown rice which otherwise take so long.  Meat browns easily in the pan and then, when sealed, those cuts of beef, pork, or chicken cook and tenderize in a flash to be used in burritos, enchiladas, or pasta meals.  Everything cooks to perfection in just a fraction of the usual time.I like the fact that this Presto model is stainless steel rather than aluminum.  However, since aluminum is a better conductor of heat, this Presto model has a bi-metal base with a disc of aluminum welded to the outside bottom of the pan.  This pressure cooker set includes a special insert rack that allows you to cook multiple foods at once without their flavors intermingling.  (This, of course, only works if the various foods are not suspended in the same liquid together.)This Presto model is safe because it won't open while still under pressure.  If you're pressed for time, you can run cold water over the lid or set the pan in cold water to drop the pressure more quickly.  When filled, it is a bit heavy and it take two hands for me to carry it.Clean-up isn't difficult.  I wash it by hand even though it is considered dishwasher-safe.  The top can be soaked in hot soapy water to get it thoroughly cleaned.It comes with a book of recipes which include soups/stews, roasts, vegetables, rice, and desserts.", "summary": "Meals in a fraction of the usual time", "product_name": "Presto 01341 4-Quart Stainless Steel Pressure Cooker", "product_id": "B00002N602"}