{"rating": "5", "uuid": "642", "review_date": "2012-09-11", "helpful": "1", "reviewer_id": "A2D1LPEUCTNT8X", "not_helpful": "1", "review_text": "We have central air conditioning but only one control unit downstairs, so the second floor is always warmer and less comfortable than the first floor. I tried putting fans at the bottom of the stairs to the second floor to improve air circulation but the air did circulate well my old fans as they could drive the air up the stairs. Purchasing this pivoting fan made all the difference! This fan immediately help drop the temperature upstairs by about 2-3 degrees.I am attaching a collage of 5 photos under customer photos that I will be referencing in this review.I LIKE:------1. The best feature of this fan is the pivoting ability of the fan. The fan pivoted and held its position straight out of the box, I did not need to adjust or tighten anything. Photo #1 shows the fan pivoting, Photo #4 and photo#5 show two views of the fan at the bottom of my stairs.2. Photo #3 shows the fan on the digital scale. The fan is fairly light just under 7 pounds and 2 oz.3. I like handle on the top of the fan. It makes it very easy and comfortable to carry it around.4. The fan is fairly quiet even on the high setting. It producing no rattle noises of any sort, the sound you hear is white-noise type sound of blades pushing the air. It is so quiet that on a number of hot nights I took that fan into the bedroom. I am a light sleeper yet the noise from this fan did not bother me even as I was trying to fall asleep.I DON'T LIKE:-------------1. Minor: the switch to turn on the fan in the center back of the fan. So when you pivot it up you need to reach under the fan to turn it on or off. Close-up of the switch is shown on Photo #2.2. Minor: the length of the cord is 6.5 feet. I wish it was longer. I have to use the fan with an extension cord.Lasko 3300 fan is sold under several slightly different names but with the same model number and description. From April 2012 to September 2012 the price of this item (when sold directly from Amazon with free shipping) varied between $30 and $34. At the time of writing this review the best price is on this oneLasko 3300 Wall Mount Fan.  I use a handy tool that helps my price comparison shopping on Amazon, if you search in google for Amazon price alert the one I use has 'camel' in its name.  It shows you the history and also can send you an email when your desired price is reached.Overall, I am very pleased with this fan and it quickly became my favorite fan of the 4-5 fans we have in the house: it pivots for great air flow control, it is powerful to quickly cool a room, and it is quiet to do its job without being noticed.Ali Julia review", "summary": "Powerful and quiet! This has become my favorite fan", "product_name": "Lasko 3300 20\" Wind Machine 3 Speed Cooling 3300", "product_id": "B00002N5ZB"}