{"rating": "5", "uuid": "372", "review_date": "2010-06-13", "helpful": "21", "reviewer_id": "A17V9XL4CWTQ6G", "not_helpful": "22", "review_text": "COMPARISON:Cuisinart Automatic 1.5 qtthe Rival Gel Canister, and theRival Electric 4&6 qt iceI have had quite the experience with ice cream makers lately and am happy to pass on my own comparison.I actually bought the Rival Electric 6qt ice on a whim when I passed by it in the store. This is the same one as the 4qt. ice cream maker that uses rock salt and ice, just larger. (I know it's the same because the inlaws have the 4qt.  It was on sale at Wal-Mart and even cheaper than Amazon.I then exchanged the above ice cream maker, after issues I will get to, for the Rival Gel.You'll notice, however, I have the \"verified purchase stamp\" on my review of the Cuisinart 1.5 qt automatic ice cream maker. That's because I gave up with Rival after continued problems with my first two ice cream makers and ordered the Cuisinart from Amazon. It's a keeper. However, you may actually prefer one of the other ones I used more if your needs are different from my own so I'll break down my experiences and you can decide:But first...some TROUBLESHOOTING that may help you regardless of the ice cream maker you choose. Is your icecream more of a milkshake than ice cream? I have some chef tips:1.Never put in chunky ingredients from the beginning. They don't allow the butterfat to freeze correctly. They need to be added at the end (chocolate chips, fruit, etc.)Soy milk? No problem.2.Never use imitation vanilla extract. It contains propylene glycol which not only isn't as good as regular vanilla, it prevents milk and cream from freezing well. Use pure vanilla only.3.Your ingredients should be cold prior to adding them to the ice cream maker.4.If you have an electric ice cream maker it needs to be on and spinning prior to putting the ingredients in. If you add the ingredients first and then turn it on, the edges will freeze first to the bowl and your middle won't catch up. (Unfortunately you can't do this on the Rival 4 and 6 qt electric so it always wound up a little runny for me.)5.If you use an electric gel-bowl ice cream maker the bowl should be stored at the back of your freezer where it is coldest. If your freezer is full of other foods, it will actually be colder than if it is empty so an empty freezer may mean you need to freeze your gel-filled ice cream bowl longer.6.Cream has a higher butterfat content than milk so it begins to melt far faster and will take longer to freeze so you will see differences from soy milk, milk, non-fat milk etc.ICE CREAM CAPACITY:Rival Electric (RE) 4 or 6 qts, depending upon which model you choose.Rival Gel (RG) one quartCuisinart Automatic (CA) 1.5 qtsNOISE LEVEL:RE: loud; cannot hold a conversation in the same room it's inRG: loud; cannot hold a convesation in the same room it's inCA: surprisingly quiet...not silent but quite a purr compared to the other two.BUILD:RE: Cheaply made which wound up being our problem. The outside core is a very flimsy plastic. Thinner than my Tupperware. Not only did this not insulate the ice well which resulted in fast melting, it also wore down after a week of the motor popping out of the locked position and it's flexibility allowed pieces of ice to get lodged in the sides and make the motor stop. This is so common that it says in the owner's manual that when it does this you need to stop it and move the ice. This means you always need to be watching it during making. Happens on both size models which is why I had to exchange this originally for the gel model at Wal-mart. That flimsy plastic wore down after just one week from the motor popping off of the lock sockets.RG: Made better than the other model except the top leaves air in too close to ice cream which means it doesn't freeze as well and the fill hole is on an angle rather than top and is very small so ingredients spill easily.CA: I like the make, compact so no warm air is inside, sturdy, stores more easily with cord compartment, heavy-duty with no flimsiness or easily broken parts.CONCEPT:RE: Winds up costing more due to needing to buy rock salt and crushed ice each time. The manual states to use crushed ice only and this is because the top pops off easily and ice can get lodged between spinning bowl and the side. For some crazy reason, the paddle doesn't spin, the bowl does which means it makes the ice migrate and melt easily. Rock salt should not go down your sink so we would also walk it outside to the street. You don't want it in your yard either. Very messy with all the rock salt and ice being poured in while running in comparison to the other two models.RG: Freeze the gel bowl for about 24 hours and use no rock salt or ice.CA: Same as the RG.ISSUES:RE: Had lots of problems with having to fool with it during the process to make it work right, turns off automatically even if the icecream is runny when it senses the edges are done.RG: Motor overheats easily and when it does this it turns off automatically and won't allow you to start it again for another 20 minutes. An ice cream maker isn't needed to mix ingredients but to whip air into it so it doesn't freeze as an ice block but instead becomes fluffy. This means you ruin your mix and have to start over. They need a more powerful motor to avoid this rather than an auto shut off which ruins your batch.CA: Does not turn off automatically and has never overheated. If you need more freezing time, you can just keep on going.  I haven't yet had any problems with my Cuisinart but will report back if one comes up.TIME NEEDED TO WORK:RE: Usually 50 minRG:  Usually 35 to 38 minCA:  Usually 20 to 30 minThe time will vary per ingredients.  I based the above all on my plain vanilla recipe.All models come with a basic recipe book but they are so basic you'll probably want a good ice cream recipe book.  I love the Ben and Jerrys one because it's not just recipes, but goes into the science of making the perfect bowl too.  The Cuisinart has the nutritionals to every recipe, the Rival doesn't.  You probably don't want to see the calories of ice cream anyway. Especially chocolate!WARRANTY:RE 1 yearRG 1 yearCA  3 yearsICE CREAM CONSISTENCY:RE: I was very disappointed in the Rival Electric.  It runs until it senses the outside edges are done but this left my inside ice cream edges not whipped. It says to get it hard you should freeze it for 4 hours but the next day, since air wasn't whipped in, it left it a block of ice and I couldn't even scoop it. Because of this and then the plastic lock in wearing out is why I returned it for the Rival Gel.RG: I got a good batch but it was still softer than I wanted, however the next 2 times the motor got hot and, as per the owners manual, apparently this design flaw is common enough that it turns itself off when this happens and won't start again for another 20 min leaving me with 2 bad batches so I returned it.CA: If you like yours soft, 20 min seems to work well for that but I usually go all the way to 30 min to get the perfect consistency of whipped air into the icecream allowing it to be soft but still easily scooped days later.  Even on high butterfat ice cream recipes we had a perfect consistency so I fell in love with this one. That was the main thing for me, to get a good whipped up ice cream. Not an icy one even days later. This one is advertised as having a \"heavy duty motor\" which may mean the difference in it not overheating.CLEANING: Owners manual of all say to clean parts in warm soapy water, not the dishwasher.CONCLUSION: Although the Rival Electric holds more ice cream which is perfect if you are making it for a big crowd, I have had no negative results with the Cuisinart since I ordered it while the other makers were returned to the store...and I rarely return anything. However, it's also possible I just got unlucky so if you want a large capacity and have easier access than I do to crushed ice, it might be worth a try.For me, the Cusinart 1.5 qt is just the right size to keep the ice cream fresh for us before it's time to make another batch. For a large family, it may not work, but we nibble on it for a week then make another batch and that works great for us and since the consistency and motor where better than the Rival Gel for me this remains my pick.", "summary": "First-hand comparison of 3 ice cream maker models", "product_name": "Cuisinart ICE-20 Automatic 1-1/2-Quart Ice Cream Maker, White", "product_id": "B00000JGRT"}