{"rating": "4", "uuid": "3", "review_date": "2013-05-04", "helpful": "26", "reviewer_id": "A3UPYGJKZ0XTU4", "not_helpful": "27", "review_text": "There is no shortage of pop recipes available for free on the web, but I purchased the \"Zoku Quick Pops\" book, because Zoku has some good recipes for fruit pops on its blog. I was hoping there were more where those came from. This book emphasizes very sweet dessert pops, however. There are 41 recipes in total, only 13 of which are fruit pops. There is a \"Fresh and Fruity\" chapter, followed by three chapters of dessert pops entitled \"I Scream for Quick Pops!\", \"Bake Shop\", and  \"Coco Loco\". As you might guess from the last one, there are 15 pop recipes that contain chocolate.Chapters on \"Tips\" and \"Techniques\" are useful. There is more detailed information about ingredients that don't freeze well in the Zoku than is found in the instruction manual. The book lists options for dairy products and sweeteners, tells you how to do different types of layers, how to add decorative fruit slices, how to do a quick shell, and how to make core pops. The pages about core pops are especially helpful, as they include recipes for pink, purple, and orange outer layers for brightly-colored core pops. The book recommends using Zoku accessory kits, but you can do without.The pop recipes tend to go out of their way to be as sweet as possible. Many, including the recipe for a vanilla base, call for vanilla pudding, where vanilla Greek yogurt would do just as well. I've substituted it with no ill effect. On the bright side, many of these recipes may appeal to children, whereas most pop books that I have seen are geared more to adults. There are flavors like \"Cookie Dough\", \"That's a S'more\", chocolate peanut butter, and peanut butter and jelly. All 9 recipes in \"Bake Shop\" are inspired by cake and cookie recipes.As a resource for light, fresh-tasting fruit pop recipes, \"Zoku Quick Pops\" is very limited. Most of the fruit recipes are gimmicky and contain too many ingredients. The recipe for Lemonade pops contains orange juice, which is fine, but the addition of vanilla extract kills the fresh fruit flavor. The recipe for mango pops includes orange, apple, banana and lemon, which are too many competing flavors. Mango and orange together make a terrific pop. The book is great for chocolate lovers and those looking for dessert pop recipes. Tips and techniques are also useful. For fruit pop recipes, \"Top Pops\" by Emily Zaiden is far better.", "summary": "Excels at Sweet Dessert Pops, but Falls Short on the Fruit Pops.", "product_name": "Zoku Quick Pops Recipe Book", "product_id": "0615391206"}