{"rating": "4", "uuid": "340", "review_date": "2006-09-27", "helpful": "3", "reviewer_id": "A2K500ZD3ZMJV7", "not_helpful": "3", "review_text": "My mother bought this for myself and my husband for xmess about 4 years ago.  We were in love!  The coffee is amazing, better than anything you can get at St@rb*cks and waking up to freshly ground, freshly brewed coffee is a fine motivator to get out of bed in the morning.I like that you can set the length the hot plate stays on all the way up to 4 hours as well the ability to adjust the temperature of the hotplate.  In the winter I like my coffee scalding but in warmer months I prefer it a bit less heated.Cleaning the machine - why is this an issue for people?  It literally takes seconds to rinse the parts off under the tap.  You don't want to use soap in a coffee maker ever.  We use a kitchen scrub brush to rinse all the grounds off under the tap and then DRY THOROUGHLY before putting it back together.  Not drying tends to cause the grounds to not transfer properly into the basket.Complaints:Honestly, 4 years wasn't enough time for me.  I feel it should have lasted longer and even then, for two of those years, we were limping along having to coax it into operation most mornings.  After a while some water or something got into the computer and we could no longer set the time or use any of the computerized controls, but still we pressed on.  Eventually even our tricks to bypass the quirks stopped working and we threw it out.  We plan to buy another very soon but are debating the thermal carafe version vs this one.This is a great machine, a bit over priced for the life span, but hopefully Cuisinart will pull their heads out of their nethers and make one that doesn't suck quite so much.  Regradless we're still going to buy another.  The quality of the coffee is unsurpassed by any other machine (save my pump espresso machine) and we love our coffee around here.", "summary": "Pretty fantastic little machine", "product_name": "Cuisinart DGB-300BK Automatic Grind & Brew 10-Cup Coffeemaker, Black", "product_id": "B00000JGRS"}