{"rating": "5", "uuid": "506", "review_date": "2000-09-27", "helpful": "144", "reviewer_id": "A281NPSIMI1C2R", "not_helpful": "154", "review_text": "After several failed attempts, I began to wonder if I would ever be able to make creamy dreamy ice cream at home.  Finally, I ordered the right one!  This ice cream maker really does work.  The only time it will not work is if your freezer is not set to the coldest setting.  I keep the freezer bowls in the freezer at all times, that way they are ready to go.So, set your freezer to the coldest setting two days before you intend to make the ice cream.  I also found the extra freezer bowl to be indispensable.  Instead of waiting for the ice cream mixture to cool, simply use one of the freezer bowls to cool it down and then pour it into the second freezer bowl.  This drastically speeds up the process.I also use the freezer bowl for other items I want to cool down quickly.  I use it to cool down Jello when making a Raspberry Mousse.  I have been known to place the whole contraption right into the freezer.  I guess you are not supposed to, but I am still alive.So, once you have everything all frozen, set the machine up and make sure it is on a nice level surface (in or out of the freezer).  Then, mix up your ice cream recipe.  All you do is pour the liquid into the ice cream maker and with a flick of the switch the paddle starts to turn and in about 20 to 30 minutes you will have the ice cream of your dreams.When washing out the bowl, you will notice that you have to use hot water or you may find the cold water starts to freeze on the inside.  I recommend placing a piece of plastic wrap over the top of the bowl when storing it in the freezer so there is no need to rince the bowl.  I also disobey the instructions and let the ice cream freeze until solid in the ice cream freezer bowl.  I found it just works faster that way.  That way your ice cream is ready in 40 minutes!  Yes, it takes 20-30 minutes and then 10 more minutes in the freezer.  At least that is how it goes in my kitchen.  It is still well worth the wait.  If you start the ice cream before dinner, you won't even notice the time.Here is a favorite recipe for a slushy.  Yes, you can make those too and it works quite well.PINK GRAPEFRUIT SLUSHUse grapefruit juice found in the cooler section of your grocery store or use fresh squeezed and strained juice. If you enjoy sitting outside and want to keep your drinks ice cold, purchase a few \"gel mugs\" which you can keep in the freezer.4 cups pink grapefruit juice1/4 cup orange blossom honey1/8 teaspoon vanilla extract1.  Pour grapefruit juice into a tall jug.  Heat honey in the microwave and stir into juice.2.  Set up ice cream maker.  Pour in juice, freeze 10 minutes or until slushy.  Serve in tall glasses with straws.Makes 4 glasses~The Rebecca Review", "summary": "Ice Cream keeps us warm in winter?", "product_name": "Cuisinart ICE-20 Automatic 1-1/2-Quart Ice Cream Maker, White", "product_id": "B00000JGRT"}