{"rating": "5", "uuid": "414", "review_date": "2008-07-26", "helpful": "1", "reviewer_id": "A1VG8MIWDUP332", "not_helpful": "1", "review_text": "I love frozen yogurt. However, in my neck of the woods, sometimes it is difficult to find decent frozen yogurt that is not filled with sweetners and other additives. I make my own yogurt, and thought I would pick up an ice cream maker and give homemade frozen yogurt a shot.After reading the reviews on Amazon and other places, I was wary about getting the Cuisinart. I was attracted to the high end ice cream  makers, but the cost was way too prohibitive for me. So I thought, what the heck, let me try the Cuisinart - it got much better reviews than the Krups.Well, I just tried my first batch. I was a little skeptical that I would get anything more than soft goo that had been described by other reviewers, especially since I made up my own recipe using evaporated milk and my own homemade yogurt.Wow - it worked like a charm! In 25 minutes, I had a nice soft ice cream that I would be willing to eat right there, but I did put it into a plastic container for further hardening. Since there are no preservatives and it is sweetened to my tastes, the frozen yogurt is clear and bright tasting, without any after taste or gummy feeling on the tongue.I am sooo happy that I have bought this appliance. No more store bought frozen yogurt for me!! I just invested in a bunch of different Sonoma Syrups (I used Meyer Lemon for this batch). Mmmmm.My tips:1. I froze the tub in my deep freezer for 48 hours.2. My ingredients were cold when I added them.3. I took the tub from the freezer, turned it on and immediately added the cold ingredients. I did not allow any time for the tub to warm up.4. I took another reviewer's advice and placed a plate on top of the unit to help keep the tub cold while running.I do not understand why so many have problems with the ingredients not freezing. I could not be more pleased with the results!I would definitely recommend this to others! Just follow the directions, and the whole world of custom frozen desserts opens up - at a very reasonable price!!!!", "summary": "This Ice Cream Maker Works!", "product_name": "Cuisinart ICE-20 Automatic 1-1/2-Quart Ice Cream Maker, White", "product_id": "B00000JGRT"}