{"rating": "4", "uuid": "393", "review_date": "2012-06-19", "helpful": "3", "reviewer_id": "A2YWHYLGHUTXB5", "not_helpful": "3", "review_text": "This works well, but there are a few points to make it a success.-First, make sure your freezer is cold. A lot of freezers are too warm. -10 to zero F is ideal. Recommended food storage is halved for every 5 degrees above zero F. At -10 you are golden for this unit.-Second, make sure you freeze the bowl for a long time. 24 hours should be enough.-Third, make sure your ingredients are cold. Even if they are cool, it should be ok, but will be softer.Custard based recipes work great. Regarding taste... I'm amazed how many people have become so accustomed to artificial flavors and conditioners, that \"real\" doesn't taste right anymore. I find pure cream based recipes can leave a bit of a film on the roof of the mouth regardless of the tool used, but cutting with 25% half-and-half or whole milk is a good ratio. Nothing beats a good custard based ice cream on a hot day, four or five ingredients: Cream, sugar, eggs, flavorings, home run.Some things I don't like about it:Gel based freezers work, but they warm up from the second you take them out of the freezer. The old style salt and ice can maintain temps well, and the expensive integrated freezer units are about perfect, but obviously cost more. You need know know that going in. Gel isn't magic, but it works. You can't fault it for being something it's not though.The dasher doesn't scrape the side of the bowl, it sits off just slightly. This leaves a ring of frozen icy cream, not a smooth ice cream stuck to the side. I think the newer version has a better dasher/scraper.I might try running it in the freezer on an extension cord... why not.No way I would pay full retail for this, but at the current price point, it's a good deal.Also consider buying a treadmill or running shoes.", "summary": "Works well", "product_name": "Cuisinart ICE-20 Automatic 1-1/2-Quart Ice Cream Maker, White", "product_id": "B00000JGRT"}