{"rating": "5", "uuid": "292", "review_date": "2006-10-19", "helpful": "125", "reviewer_id": "A2806I45H42REF", "not_helpful": "127", "review_text": "I have been using the Mini-Prep for a few years.  I like to use it for small jobs like chopping herbs, parmesan cheese, and for making pesto.  I haven't had any problems with processing parmesan cheese as one reviewer did.  The blade has two sides, a blunt side for processing hard items like parmesan cheese, chocolate, and coffee beans and a sharp side for processing soft items such as onions, garlic, meats, and mushrooms.  The sharp side is labeled sharp.  If you alternate between processing hard and soft items, you have to remember to check the position of the blade to make sure you are processing with the right side.  In addition, the processor has two speeds, HI & LO.  The LO speed is recommended for use with the sharp side of the blade and pulse action while the HI speed is recommended for use with the blunt side of the blade and continuous processing.  The Mini-Prep has a lot of kick to it for such a small appliance, and I have found it best to hold it steady with one hand, particularly when processing hard food items, because it will jump when powered on.One thing I noticed, in the instruction and recipe manual under Operating Techniques, the instructions indicate that hard cheese is processed with a blade and position speed of Blunt/HI but the instructions for grated parmesan cheese in the recipe section uses Sharp/HI.  I pulse at BLUNT/HI and then do continuous hold until its grated like I want it.  For best results, cut the cheese into small pieces as indicated in the instruction manual before processing.The Mini-Prep does a fairly decent job of chopping onions and garlic. On occasion I find a stray piece that the blades missed but that's probably because I don't always cut the pieces as recommended.  Overall, I think this is a great little processor and well worth the price.  Just remember to read the instruction manual before you start using it.", "summary": "Mini-Prep", "product_name": "Cuisinart DLC-1 Mini-Prep Food Processor, White", "product_id": "B00000JGRP"}