{"rating": "5", "uuid": "289", "review_date": "2010-01-28", "helpful": "0", "reviewer_id": "A319GULZWIN1YX", "not_helpful": "0", "review_text": "I bought this unit to replace one I had purchased in 1995 or 1996.  I originally wanted to replace just the bowl as I had broken it, but with Amazon's price of $26.60 total I just had to go for an entire new unit. It was shipped free too.  I ordered the new Black Chrome finish and it really is lovely. My original one was white and this is a very surprising addition to the line for such an inexpensive price!!The only thing I can say from reading the other comments is people are expecting too much from this smallest of food processors.  It is made (and tells you so in the instructions) to be used continuously for no longer than one minute. If you pulse it properly and don't just leave it running, it is fine. This processor is the one I keep under the kitchen cabinet to be used to make small amounts of sauces,finely chop up garlic,chilies, etc. I have a much larger DLC-5 which I use for larger tasks.If someone is purchasing this for the first time I highly recommend sitting down and reading the instruction booklet before proceeding.  I haven't had any problems with the old one because I did that very thing when it first arrived. I even read the new booklet again, just to make sure if they made any changes.I was most happy to find all these years later, they still manufacture the original unit. I am not a touch pad fan and I am happy Cuisinart recognized many of us still like the original processors just as they were!! Adding the new finishes to the line as I said above just sweetened it up for me!!!It does have a powerful motor, but it is only a 21oz capacity, so that should make people aware not to over extend their expectations.  It is the perfect compliment to the larger processors and I would highly recommend it. For such an inexpensive price I think it is worth it!", "summary": "Cuisinart Mini Prep Food Processor", "product_name": "Cuisinart DLC-1 Mini-Prep Food Processor, White", "product_id": "B00000JGRP"}