{"rating": "5", "uuid": "755", "review_date": "2008-08-11", "helpful": "15", "reviewer_id": "AU2DAD4WD5Z0C", "not_helpful": "15", "review_text": "This is not my first pressure cooker. I was looking for a replacement for some weirdo one my hubby's ex left him years ago. I have a giant-sized Presto pressure canner and love it. So I like Presto and liked the size of the ex's weirdo canner. (weird because it had handles that came off all the time, no instructions, no visible brand I could find and was a strange operator.)I wanted stainless steel--easier in the long run, to clean and to cook in. Six quarts is just about the perfect size since I rarely cook for a crowd anymore.This is a nice, solid, reliable cooker. Presto does a good job on the owners manual, some basic recipes, etc. The cooker has a little rack so you can keep your meat off the floor of the cooker.This is not a canner. You could (and I have) use it as a little baby canner for a small load of small jars. I have used it as a canner for about 4-5 pints. The instructions do not say this is a canner, and you probably should know what you're doing if you plan to can with this. It takes about the same amount of time whether you can in this or in the giant cooker, so why not do a large load, I say.Pressure cooking doesn't necessarily save time depending on what you're cooking, when you consider it takes a while to build the pressure. This takes some practice, and knowing your food and your stove. I like it because it cooks meat really tender quicker than any other method.It takes very little experience to get to know the proper pressure without a guage. It makes a rythmic rocking noise, not too fast,not too slow.I find clean up a breeze. This baby is dishwasher safe. I soak it a couple minutes, if needed, then pop her in the DW. Take the rubber gasket off first. You should always hand wash the gasket.", "summary": "Great pressure cooker-highly recommended", "product_name": "Presto 01341 4-Quart Stainless Steel Pressure Cooker", "product_id": "B00002N602"}