{"rating": "4", "uuid": "385", "review_date": "2008-12-22", "helpful": "2", "reviewer_id": "A23GFTVIETX7DS", "not_helpful": "3", "review_text": "I own both the Cuisinart 1.5 quart ice cream maker and theKitchenAid KICA0WH Ice Cream Maker Attachment, both of which make excellent ice cream, although this Cuisinart, as a special purpose appliance, will appeal to a broader range of people simply because the unit is self-contained.The Cuisinart works without salt or mess; the bowl walls contain a liquid that, when frozen, becomes extremely cold, enough to freeze a cream/custard base to soft serve consistency.  (More on that later.) For the machine to successfully work, the bowl must be placed in the freezer at least fifteen hours in advance, and the mix must be refrigerated for a minimum of 12 hours, preferably at least 24 hours.  Unless you store the bowl in your freezer and use a non-cooked mixture, you won't be able to make ice cream on the spur of the moment.The machine is fairly noisy, much like the earlier electric churners that used salt and ice.  But operation cannot be easier.  Simply insert the paddle, pour in the mix, attach the top, and start it up.  In 20-30 minutes, depending on the butterfat content and beginning temperature of the mix, you have soft serve consistency ice cream, sorbet, frozen yogurt, or sherbet.  To improve the flavor and consistency, the frozen dessert should be ripened in another container for at least 2 hours in the freezer.The biggest drawbacks to the Cuisinart ice cream maker are its relatively small size, especially compared to the KitchenAid attachment, and the way a portion of the ice cream freezes solid to the sides of the bowl, thus creating some waste.  Of course, you can always take a sturdy non-metal utensil to it to sample it right away.  You'll have to let the bowl thaw some before hand-washing.  None of the parts are dishwasher safe, although all are a breeze to clean once the bowl loses its extreme cold.If you own a KitchenAid mixer, you might want to check out the attachment, but you really can't go wrong with the Cuisinart.  Fresh ice cream has never been easier.-- Debbie Lee Wesselmann", "summary": "Easy ice cream, with some advance preparation", "product_name": "Cuisinart ICE-20 Automatic 1-1/2-Quart Ice Cream Maker, White", "product_id": "B00000JGRT"}