{"rating": "5", "uuid": "810", "review_date": "2006-05-12", "helpful": "550", "reviewer_id": "A2YK3OALZ48XPF", "not_helpful": "559", "review_text": "I bought this cooker 6 months ago from amazon for $35, and frankly, although the reviews I read on this product all said that it's great, I was very skeptical about the $35 price tag and was not expecting much.  On top of that, both my mother and my mother-in-law warned me that cheap pressure cookers are dangerous, and I *must* buy something more expensive for safety reasons. I am just very glad that they were both wrong!This is definitely one of the best purchases I have made on amazon. I still cannot believe they sell this for $35! The pot does not feel cheap at all. It has very sturdy handles, and a thick, heavy bottom, which holds in heat well.  I like this pan so much that sometimes I use it instead of my skillet to sautee meat, because of the deeper pot + the cover, less cleaning up for me :-)I love making soup and stock, but it usually takes up so much of my time when the stock is simmering.  With this pressure cooker, I can make a meat-fall-off-the-bone soup in an hour!Some might find this pot to be a little on the small side, but this pot works great for my wife and I. Although we have guests over regularly, I find the capacity of the pot to be very good. I would guess that this pot would work well for up to a 4-person family.Pros:=====- Cheap, at $35, it's hard to beat- Sturdy, I was afraid that the plastic handles would break easily, but they are in fact quite strong- Stainless steel makes it great for browning meat pieces for stew or stock, and it heats up fast and holds heat well.- Safe, you cannot open it when it's pressurized.- Dish washer safe, though I prefer to wash it by hand.Cons:=====- The handle can be tricky to hold with one hand. My hands are small, and when you've closed the top, the handle is kind of big. Luckily, I don't need to do this very often, and when I need to move it around, I just use both handles.- The top cap can be tricky to clean. I usually soak it in hot soapy water, and then clean it thoroughly with Q-tip.Watch outs:===========- The handle curves in a way that it catches any dripping liquid, I've hurt myself once when I wasn't careful at opening the cover.- Do *NOT* remove the cap while it's blowing! The steam from inside is extremely hot and as soon as you remove the cap, the hot steam will shoot up faster than you can move your hand(s) away.Tips:=====- I keep some water bottles in my freezer, and when I need to cool this off in a hurry, I can make a bath of cold water in my sink, put the hot pot inside, and throw the froze water bottles in. This usually cools it down very fast, great when I want to refrigerate it overnight to skim off the fat, and didn't want to wait too long for it to cool down.", "summary": "great value, sturdy cooker", "product_name": "Presto 01341 4-Quart Stainless Steel Pressure Cooker", "product_id": "B00002N602"}