{"rating": "5", "uuid": "499", "review_date": "2010-04-04", "helpful": "5", "reviewer_id": "A27DDHWHE540I5", "not_helpful": "5", "review_text": "I've been making homemade ice cream since 1985 when I got my Waring Ice Cream Parlor machine and the Ben & Jerry book as a birthday present. Twenty-five years later, I donated the Waring machine because I no longer had the patience to bother with all that sloppy ice cube & salty mess! (Machine still worked; donated it to my church). I did tons of online research and hands down, THIS machine got top ratings no matter what site I visited. Some places offer a 2nd bowl for an additional price but I knew I wouldn't need that much ice cream. VERY QUIET and made the 2nd batch of peach ice cream in record time; set timer for 30 minutes, it was done in 18 minutes! Easy to clean, very small to store; bowl is kept permanently in deep freeze at 0 degrees.NOTE: The miniscule Cuisinart recipe book that comes with this states that the bowl will be frozen within 6-12 hours. Don't believe it, we did and almost returned the machine! I checked the canister after 10 hours and it didn't slosh one bit, but after one hour of processing the cream mixture, it was no more frozen than the Equator! Saved the cream mixture to try the next day; froze it for 24 hours, and as I said above, it made a batch in 18 minutes, flat.I've also noticed that although it says \"generous 1.5 quart size\" my recipe for 1 quart of ice cream came so close to the top of the dasher that it actually flowed over a bit. So, I'm going to use slightly less than 1 cup measurements for the liquids when I make the next batches to avoid this problem.So far we've made peach, strawberry and banana ice cream. Try using a high quality buttermilk for 1 cup of the liquid; it's low calorie and adds a nice twang to the end result.", "summary": "Finally! No 4 trays of ice cubes and a box of salt!", "product_name": "Cuisinart ICE-20 Automatic 1-1/2-Quart Ice Cream Maker, White", "product_id": "B00000JGRT"}