{"rating": "3", "uuid": "250", "review_date": "2011-10-03", "helpful": "0", "reviewer_id": "AUITG1DJ3QUGK", "not_helpful": "0", "review_text": "I came here looking for a replacement for the bowl which came with my mini prep becaue I dropped & chipped it, and now it leaks :  I did find this a useful little device *BUT in a very limited way*.  It does not have a very powerful motor.  You might well not expect that on such a small unti, but when I tried to use it to grate some roamno cheese, it smelled like burning rubber, much like when I use their blender for *anything*.  the things I bought from Cuisinart 10 years ago or more were very well made.  It has been a long long time since I have seen anything from them which is not made in china, and not to the standards the brand is known for.  I suspect that they either sold the name or are outsourcing everything.  Nothing is the same quality.  I am preferentially using 20+ year old plastic black & decker equipment from when I was in college :(I guess given the cost of replacement parts I will shop for another little chopper from another brand.  If you generally cook from scratch, these are useful (chopping onion, e.g.) and yes, it can handle bread crumbs... but not even a soft cheese!off to look at what Amazon has available from Kitchinaid, Hamilton Beach...brands which are still making products the way they used to ;)Updated 12/17/2011 to note that I purchased a floor model of the kitchenaid chef's chopperKitchenAid 3-Cup Chef's Chopper, Chromeat a local store (for about what a replacement basket would have cost.... they really get you on parts!).  They were being cleared out, as a new model was coming in, so, I got it for a song; and WOW! what I have been missing all these years :O It is so so much faster, more powerful.  I never would have thought there would be such a difference!  If you are considering one of these, I would urge you to have a look at Kitchenaid's little choppers.  At this point I have several pieces from each manufacturer, and am quite happy with my Cusinart full size food processorCuisinart DLC-10S Pro Classic 7-Cup Food Processorand stand mixerCuisinart SM-55BC 5-1/2-Quart 12-Speed Stand Mixer, Brushed Chromebut in the prep realm, kitchenaid has the better tool.", "summary": "Not made to the same standards as older devices", "product_name": "Cuisinart DLC-1 Mini-Prep Food Processor, White", "product_id": "B00000JGRP"}