{"rating": "5", "uuid": "848", "review_date": "2014-02-15", "helpful": "0", "reviewer_id": "A3PMO3HY3PH6Z", "not_helpful": "0", "review_text": "Full size thick heat disk on bottom for even heat distribution, heat retention (for searing) and efficiency. Easy to use. Nice straight up sides (easy clean up, no scorching, and even heat from disk rather than heat caught going up around sides), well constructed and handles can be re-tightened. Handles don't get hot. Capacity lines are a part of the steel so they won't rub off, and aren't indented or stamped (many come with no lines or cheaply printed lines). The most dishwasher safe pressure cooker I've looked into (though I don't have a DW and wouldn't bother to use one). The fairly wide base was not too wide, and worked fine for cooking a single serving of rice (1/2 cup dry rice). I feel totally safe using it with all it's safety features.Though it's not billed as a quick release PC or commonly reviewed as one; you can fairly safely lift the weight off with a silicon mit (safer I dare say than I've seen some that are considered quick release). I'd even dare to do it bare handed as the metal under it is hot (don't touch), but the plastic part of it hasn't gotten too hot to touch. I have the fingers of a professional cook and have touched the metal part w/o getting burned, but it is freaking hot. It's not like the handles get too hot to carry it to the sink anyway (if it's available).No electric / computer parts to fail and leave you with a pile of junk (this should last a lifetime aside from some affordable replacement parts like gasket and safety plug). Higher pressure than electric models. No toxic Teflon or shady/ reactive aluminum. Not dependent on electricity or any particular heat source: you could use candles, camp fire, solar, induction, etc.I like that I can hear how it's doing from my living room without it making annoying sounds. If it's clanking: I know to turn the heat down.Any improvements that could be made to it I think would be personal preferences; like some might contend that the handle is too long restricting storage space.", "summary": "An amazing value!", "product_name": "Presto 01341 4-Quart Stainless Steel Pressure Cooker", "product_id": "B00002N602"}