{"rating": "5", "uuid": "379", "review_date": "2008-09-26", "helpful": "9", "reviewer_id": "AE29A0NN7V5I0", "not_helpful": "9", "review_text": "I've owned this ice-cream maker for a month and just love it! To avoid the problems other reviewers have experienced, just follow these tips (some posted by other reviewers too):1) Freeze the bowl with a bag of ice cubes in it (thanks for the tip, Cynthia Nelson). It worked for me, and now I only need to freeze it overnight (instead of 48 hours each time I wanted to use it).2) Use a blender to mix all ingredients! It's easier to pour from the blender jar into the ice-cream machine, and the sugar is properly mixed and melted into the heavy cream.3) For fruit-flavored ice cream, use frozen fruits instead of fresh fruit puree, or you can buy fresh fruits and cut them up and freeze them. Blend away as you would if you were making a smoothie. I did this and compared it to using fresh fruit puree and found that the \"smoothie\" mixture chills and thickens faster in the machine (10 - 15 mins); whilst the fresh fruit puree mixture tends to take about 30 mins or longer and yields more crystals when the mixture is frozen.4) Put a small bag of ice on top of the opening of the transparent lid - use the bag of ice cubes that you put into the bowl in the freezer. It helps with chilling the mixture faster while it is being churned. Mine did not melt nor drip into the mixture.5) Put an empty glass container in the freezer before you start making the ice-cream mixture. Use it to store the ice-cream. I use a Pyrex bowl with its lid as glass chills faster than plastic.I modified a recipe I found online, and get awesome creamy ice cream which doesn't get frozen hard like a rock even when it's been in the freezer for 2 - 3 days! You can, of course cut down on the sugar or use fat-free products or artificial sweeteners (which I haven't tried - I believe natural is better than those chemicals in artificial sweeteners. Our bodies can work off the sugar, but the chemicals stay in our system!)1.5 cups heavy whipping cream1 cup Half & Half or evaporated milk1 - 1.5 cups frozen strawberries or any other frozen fruit1 + 1/4 cup granulated white sugar2 tablespoons lemon juice (optional)Put everything in the blender and blend until the ingredients are well-mixed. Turn on the ice-cream machine and pour the mixture in. Once the mixture thickens and has a soft-serve or thicker consistency, turn off the machine. Scoop and serve, or pour and scrape the mixture out with a rubber/silicon spatula into your chilled glass container and freeze for about an hour or so.", "summary": "Makes great ice-cream - follow these tips!", "product_name": "Cuisinart ICE-20 Automatic 1-1/2-Quart Ice Cream Maker, White", "product_id": "B00000JGRT"}