{"rating": "5", "uuid": "517", "review_date": "2006-02-12", "helpful": "37", "reviewer_id": "A12C9MW5X8V5RY", "not_helpful": "41", "review_text": "We like ice cream. A lot.The Cuisinart Ice 20 Ice Cream Maker enables us to have ice cream with only a half hour's notice. Is this good or bad?Good, I say! Lick the beater, the cylinder and your bowl kind of good. All this in record time and without much effort on your part except for that tiresome spoon lifting.Make Ice Cream in the Privacy of Your Own HomeIce cream is not the difficult concoction it may seem. All you need are a few simple ingredients, depending on your taste, an ice cream maker, rock salt, ice ...Uh-uh! Not with this machine! The Cuisinart Ice-20 lets you toss the rock salt out on the slippery sidewalk where it belongs and requires no melting bags of ice to stuff in the freezer in advance.More \"No's\":* No more hand-cranking* No more frozen chunks of ice jamming the rotating freezer cylinder and stopping the machine mid-cycle* No more relegating the ice cream making to the basement, the garage or outside where dripping salt water can run will-nilly out a drain hole that's never in a convenient place* No more trips to the supermarket or to the ice cream shop down the street* No more, \"Sorry, we're out of that.\" Make whatever you like!Am I Really a Good Spokesperson for This Ice Cream Maker?You betcha!We are high-end ice cream people. That does not mean we eat only Hagen Daas quality stuff (well ... we actually do), but that we could keep a small ice cream shop in business with just our family. Counting relatives, we could support a chain of such shops.We eat a lot of ice cream and we like a variety of flavors. The Ice-20 allows us to have the best of both worlds -- with a little time for preparation in between, of course.The PackageThe Cuisinart Ice-20 comes boxed with:* a cylindrical plastic churn* one freezer bowl (1-1/2 quart with liquid encased in it for purposes of freezing)* the motor housing* a clear plastic dome lid* a manual/recipe bookThere is also a reply card in the box with which to document your purchase. SEND THAT IN TOOT-SWEET! This little appliance comes with a 3-year manufacturer's warranty on defects. Not a shabby deal in the least.Each piece is wrapped carefully in plastic bags, which I suggest saving, too ... the larger ones, at least. Use these to wrap the freezer bowl while preparing it for use. More on that to come.So Now You've Unpacked It ...What to do with an ice cream maker you just unwrapped? One might like to rip right in to making ice cream, but that can't happen with this particular machine. It does not offer a compressor in order to chill the product as you go ... you have to provide the cold, and that means cleaning out a space in the freezer -- and make it a permanently-cleared space 'cause you'll need it. Trust me.You'll want to wash the freezer bowl, first.- in the sink ONLY -- no dishwasher- no abrasives/no cleansers- warm water and liquid soap with a soft cloth and a good rinse- dry thoroughlyOnce washed, wrap the bowl in plastic. This keeps that \"freezer taste\" from getting into your frozen product-to-be. Use that handy bag that came with the unit, or use a plastic grocery bag to enclose the bowl. Place it in the freezer and close the door. For extra-fast chilling, put a bag of frozen vegetables inside the bowl.My bowl freezes in my refrigerator freezer in 8 hours. It should be a solid freeze. No sloshing, or your ice cream won't \"ice\". I hear tell it can take much longer for some folks' bowls to freeze, but check your freezer setting ... it should be, according to Cuisinart, at 0?, but mine is at 25? and works quickly.Once your bowl is solidly frozen, make your ice cream base. There are a few recipes for ice cream, sorbet and frozen yogurt in the recipe book included with the Ice-20, or use one of your own, but be sure it is for 1-1/2 quarts or less.We make only full-fat, fully-flavored ice creams which I can recommend, but we do not partake of sorbets or frozen yogurt, yet I can't imagine the experience would differ. The methods remain similar, and if you have frozen the bowl you're more than half way there.Come Along with Me ... the Best Is Yet To BeFrom start to finish the Cuisinart Ice-20 is easy to use, easy to clean and a dream machine for those of us who enjoy a good bowl of ice cream often ... on occasion.Once you've frozen your bowl -- which you'll want to leave in the freezer until the last minute, simply follow your chosen recipe, remembering to leave any additives such as chocolate chips or chopped nuts out until the last 5 or 10 minutes of processing. No \"extra\" should be larger than a chocolate chip -- I'm guessing this is to protect the plastic churn.Once you have your concoction ready, retrieve your freezer bowl, place it on the motor housing, place the plastic churn inside the bowl and slip the dome lid over all, making sure to align the embossed dot with the marking on the front of the motor housing to \"lock\" it (not a fool-proof mechanism, as this opens easily with less than a twist). It's really that quick.Plug in the machine and press \"on\". The motor will rotate the freezer bowl and the dome lid will hold the churn in place. Pretty simple!Carefully pour in your ice cream base and leave the room for 20 minutes or so. I dare you to try.You won't be able to do it because you won't believe you're making ice cream right there in your own kitchen. And, you'll want to appoint yourself \"Chief Taste-Tester\", as you won't want any family, friends or acquaintances to suffer at all. How big of you. You're selfless, just as I am!The dome lid offers an opening in the center through which to add ingredients, and I use it to \"sample\". Just be careful you don't lose a spoon in there. That'll cause a few raised eyebrows and strange looks when you go to serve your decadent dessert.If, after 20 or 30 minutes your ice cream isn't as thick as you'd like it (it comes out soft-serve for me), press \"off\", remove the dome lid and clean off the churn with a spatula. Just pop the bowl back in the freezer, covered, for about an hour or less, depending. The ice cream will harden nicely in about this amount of time.This is license to continue tasting at intervals, of course.You may wish to transfer the ice cream to a freezer-safe container for longer term storage, if you expect the ice cream to last that long. That way, you can clean the bowl and return it to the freezer to be ready for another batch.Everyone Will Scream for Ice Cream!Are there any down-sides to this appliance? None that I've found yet. For the ease with which I can use this I can't complain about having to freeze the bowl, nor is it intolerable that soft-serve is my result. I LOVE soft-serve! Plus, the ice cream can be transformed rather quickly into something firmer.The machine doesn't turn off itself, which isn't a negative for me. I can keep it running as little or as long as I like, but 25 minutes has been the longest running time in my experience. After that, we're eating ice cream!As for noise, it's tolerable. I find the Ice-20 to be much quieter than a blender, and only slightly noisier than most dishwashers. I find it comforting to hear it humming along with it's little whirring sound, for that, my friends, is the sound of ice cream in the making.Added BenefitsUsing the Cuisinart Ice-20 affords you some portion control, as you can make smaller batches than 1-1/2 quarts. If you need more than that amount it's simple to prepare batches ahead of schedule and freeze them. It's also possible to order an extra freezer bowl, which I did. It's handy and I've already made use of the extra one several times.This machine offers cord storage underneath it, allowing for only as much cord as needed to reach an outlet. The cord is about 2-1/2 feet long which is plenty for counter top use. When finished, just wind the cord up completely and store the machine for later.Since the Ice-20 is about the size of a 2-1/2 quart slow cooker it isn't difficult to store. Mine lives on a shelf inside my basement door. It would fit inside a cupboard, too, if I had a place there. You could also keep it on the counter top ...And, again, it couldn't be easier to clean. All the components, aside from the freezer bowl, need only a wipe-down with a damp cloth. The freezer bowl in anodized aluminum on the inside and plastic on the outside, so warm water and dish soap do the trick easily.You Made This? Really?Having served vanilla, chocolate and mint chocolate chip ice cream at Daughter's birthday party recently, I have first-hand experience with the dropped-jaw look when people ask where you bought the ice cream.\"I made it,\" you'll say. Cool, calm, collected and concise, too.They'll not believe it, I assure you. They'll want your secret, and it's up to you whether or not to tell them.Share the joy, won't you?", "summary": "A great ice cream machine at an affordable price......", "product_name": "Cuisinart ICE-20 Automatic 1-1/2-Quart Ice Cream Maker, White", "product_id": "B00000JGRT"}