{"rating": "4", "uuid": "356", "review_date": "2010-08-18", "helpful": "4", "reviewer_id": "A188JOXWF4EY1R", "not_helpful": "4", "review_text": "We actually found this product on clearance sale at JCPennys last winter.  It has been a wonderful kitchen gadget, as long as we keep a few things in mind...1) We store the bowl in the freezer rather than trying to freeze it only when we want ice cream.  This ensures that it is nice andfrozen.2) We haven't tried to make frozen yogurt in it - only ice cream - so I don't know how it works with the yogurt.3) Ice cream recipes that call for something other than cream don't freeze as well and don't last as long after they are made.  When we make ice cream with just milk or with evaporated milk, we have to let the machine run longer and then we have to eat the ice cream within a couple of days.  It will also have a more crystallized and less creamy texture.  Ice cream with a combination of heavy cream and milk is phenomenal, though!  It will still form some ice crystals after several days in the freezer, but it's not bad at all.4) If we chill a metal mixing bowl in the freezer for a few minutes and then mix up the ice cream in it before putting it in the ice cream maker, it starts off colder and freezes better.So far I have not figured out how to make a nice, creamy low-fat ice cream in this maker, which is why I am giving it four stars instead of five.  I still need to try the frozen yogurt.  But, for regular ice cream, this is phenomenal!  We love \"chunky\" ice cream, and love to experiment with all the different things we can add to the Ben & Jerry's French vanilla recipe.  With the price of good ice cream these days, this quickly paid for itself because it's much cheaper to make our own.  We love it!(Oh, and we bought the Ben & Jerry's ice cream cookbook to go with this - it has a lot of tips for successfully making ice cream.)", "summary": "Wonderful Product!", "product_name": "Cuisinart ICE-20 Automatic 1-1/2-Quart Ice Cream Maker, White", "product_id": "B00000JGRT"}