{"rating": "5", "uuid": "595", "review_date": "2010-05-14", "helpful": "4", "reviewer_id": "A5N60O5P83HSX", "not_helpful": "5", "review_text": "I was looking for a fan that would really draw fresh air into my apartment (5 rooms, total ~1000sq ft).  It's very frustrating to me when it's nice and cool outside on a summer evening, but still sticky and stuffy inside from the heat of the day.  I've tried two of the little twin window fans, a larger oscillating fan on a stand, and small round fans in windows, but even all these of those in combination never really seemed to make a big difference in a reasonable amount of time.  I've been in houses with attic-mounted whole-house fans, and it's amazing how quickly they'll exchange the air in a whole house!  That's the effect I was hoping for.In short, this Lasko 2155a has met my expectations.  If I turn it on high exhaust, open a couple windows on the opposite end of the apartment, and close the rest, it does a great job of pulling in fresh (cool!) air.  Of course it's not as fast or as powerful as a real attic whole-house fan, but especially given the price, convenience, and simple installation, it's a pretty good substitute.  It shouldn't even be in the same category as the little twin window fans - those are good for a single room, but they don't hold a candle to this Lasko.  When this is running on high exhaust, and with only a few other windows open, there's a noticeable breeze coming in those windows.  I notice a distinct change in the coolness and \"freshness\" of the inside air after only a few minutes.  It is pretty loud when it's on high, but it's not the obtrusive roar that I've seen described in other reviews.  I wouldn't want to sit right next to it and have a conversation or listen to music, but if you're in the next room, it's really not distractingly loud.  Also, I find it's helpful to leave this on high for a few (10-15?) minutes, and then turning it to low does a fine job of maintaining the fresh air inside.  When it's on low, the noise isn't bad at all - it's quieter than the oscillating stand fan I'd use otherwise.  Not distracting or bothersome, even if you're in the same room.So if you live in a small house or apartment, and you're looking for a reasonably-priced alternative to a full attic fan, I highly recommend this one!", "summary": "Great fan!  Perfect for cool evenings when it's still stuffy inside.", "product_name": "Lasko #2155A Electrically Reversible Window Fan, 16 Inches", "product_id": "B00002N5Z9"}