{"rating": "5", "uuid": "26", "review_date": "2012-09-06", "helpful": "2", "reviewer_id": "A36DVGJ18JV1E0", "not_helpful": "2", "review_text": "This 128 page book contains pictures and patterns for 38 tiered cakes.  It gives you instructions on how to assemble cakes on stands, pillars or stacked construction.  It also contains recipes for basic scratch cakes in white, yellow, chocolate, strawberry, and banana.  It also has the recipes for standard Wilton Icings, fillings, glazes, fondant (not the tasty marshmallow kind), color flow, gum paste, and candy clay.  There are tips for baking, leveling, torting, filling and icing the cakes.  It also gives some instruction on how to cover a cake with fondant.  There are suggestions for transporting tiered cakes, calculating servings per cake and cutting guides.  The book also includes patterns and instructions for various decorations.  As with all Wilton books, the last few pages detail products you can buy from them to duplicate all the designs in the book.  The problem is that some of these items don't seem to be available on their web site any more.  The book was first published in 2005.  Still, it's a great idea book and I'm sure you can find acceptable substitutes for a lot of the items.  The book contains ideas for cakes that could be served at weddings, anniversaries, and showers.Also, I'm not sure if it's offered everywhere, but I'm currently enrolled in a class taught by a Wilton Instructor called \"Tall Cakes\".  It is taught in two sessions.  The first class is a demonstration by the instructor on how to put together a tiered cake.  The second class is where we bring in our own cakes and learn how to stack or pillar them.  It's less expensive than the other classes, no kit is required and the items needed are this book, one six-inch and one ten-inch layer cake, the plate/pillars, and our decorations.  It's a great way to top off the other four classes.", "summary": "Great Idea Book and Used in Wilton Class", "product_name": "Wilton Decorating Cakes Book (The Wilton school)", "product_id": "0912696591"}