{"rating": "4", "uuid": "407", "review_date": "2003-06-23", "helpful": "4", "reviewer_id": "A3W25DGQAN3BCA", "not_helpful": "4", "review_text": "For years I had one of the ice cream makers where you layered ice and salt in the bucket and began the process of churing ice cream.  I can tell you that after 8 years or so of owning this type of machine I made ice cream 3 times.  It was messy, clean up was a pain and it was noisy.  After my machine was ruined by a leaky roof (divine intervention) I looked around and decided to purchase the cuisinart ice cream machine.  Since owning this maching I have made ice cream atleast once a week.  I have even made ice cream to go with dessert for a dinner for 75 people.  Something I would have never have done with my old machine.The machine is easy to use, easy to clean and in my opinion not very noisy. Some of the reviewers mentioned noise, they must have never heard the noise produced by tradtional ice cream machines that have a motor. It is about the level of a food processor or blender.  perhaps because it is running for 25 minutes it seems louder to some people.As to problems of the machine not freezing properly, I can only say I have not had any problems.  I keep the bowl in my freezer and chill the ice cream and sorbet mixtures well before pouring them into the machine to begin churning.  I highly recommend buying an extra bowl if you need to make more than 1 1/2 quarts at a time. With my \"old fashioned\" ice cream machine (salt and water), they always recommended ripening the ice cream and I continue to do so.  Once churned, I turn my newly made ice cream into a differenct container and pop it into my freezer for 30 to 60 minutes at least before eating.  I have never gotten really firm ice cream out of anything but an industrial machine and I did not expect it with this one although my nieces think it is just fine straight from the bucket.With the Cuisinart icecream maker, making ice cream is fun and very satisfying.  Best of all, I did not break the bank to get good results.  Although I love the end results on some of the pricer ice cream machines, my Dr. Pepper pockets could not come up with the Champagne cost of those $100.00 or more icecream makers. I was ready say to myself, this machine is not bad for the price and I ended up thinking this machine works well and what a great price.My only issue is more with Amazon.  I am unsure were the $90.00 original sticker price came from. At the cuisinart site you can purchase the same machine for $49.95 just like here at Amazon.  I purchased mine through Amazon due to their great customer service but it seems very misleading and unnecessary for them to mark it up just to give the impression you are saving money by purchasing at the amazon site.", "summary": "easy to use and easy to clean", "product_name": "Cuisinart ICE-20 Automatic 1-1/2-Quart Ice Cream Maker, White", "product_id": "B00000JGRT"}