{"rating": "5", "uuid": "677", "review_date": "2012-09-02", "helpful": "0", "reviewer_id": "A2Q12G0CRKK0KP", "not_helpful": "0", "review_text": "I like the name of this product: \"Wind Machine Air Circulator.\" I would have just called it a fan, but I guess the given title is more accurate. I love this fan. My apt gets super hot in the summer and without central air, it can be tough during the days. The AC we have isn't quite strong enough to really cool down the place below 77 degrees or so. This fan has made the summer so much more bearable. Moving air in the apt makes a huge difference. This fan produces a strong breeze/current. It usually stays on the low setting, as that is more than enough to provide adequate current in the room.The fan is pretty quiet. There's 3 speed settings, and of course if you have it on high, it can get a little loud. But it's not nearly as loud as other fans I've owned, so I was pleased with that. It barely weighs anything, so moving it from one room to the next, if necessary, is easy. It has a nice handle on top for easy transport. The fan can also be tilted easily so you can direct the air wherever you'd like. If you don't want the air blowing right on you, you can tilt it so it blows towards the ceiling. If you want it pointed at you, pivot it to the necessary angle.My only issue with the fan is the ability to clean it. It doesn't have any easy way to disassemble it, at least that I can see. I'm not motivated enough to REALLY take it apart, so I wish there was an easier way to pop it open and give the blades a nice wipe down. Because it sits on the floor, it often sucks up my girlfriend's lose hairs and the catch on the grill. Doesn't really cause a problem, other than being a little unsightly, but you'd get that with any floor fan so I don't blame this product for that.Overall, this is a powerful, yet quiet, fan and I'd definitely recommend it.", "summary": "Great \"Air Circulator\"", "product_name": "Lasko 3300 20\" Wind Machine 3 Speed Cooling 3300", "product_id": "B00002N5ZB"}