{"rating": "5", "uuid": "597", "review_date": "2012-03-27", "helpful": "4", "reviewer_id": "AED8F9CKVJ8QI", "not_helpful": "4", "review_text": "Absolutely fabulous.  Does exactly what it's supposed to, extremely well.  To install, you simply position screws into each side of your window frames- The fan's plastic privacy side panel extensions have little notched-out grooves on the edges, that slide right into the screws. Done!This fan gusts air like a tornado!  It's a completely different class of product, vs. those little toy-like \"twin window fans\" made by everyone, and sold everywhere, that barely move any air.My house is a 900 sq. ft. brick ranch, 1950's built with original windows (wooden sash/panels), and no central A/C.  This is truly a whole-house fan for me!  Completely turns over the entire house air in a matter of seconds. The direction of air flow (intake/exhaust) changes with a simple manual turn-knob.  There is a BIG difference between low/medium/high settings, which enables you to customize air flow to your liking.  Since the knob is manually operated, there are no complex, computerized electronics to malfunction.  While I'm readily technically competent, I HATE it when simple things are un-necessarily complicated, & therefore prone to electro/digital malfunction.  This is a purely simple, incredibly well designed, powerful window fan.Space usage / appearance:  It lies flat, on the back side / up against your window (this design is what allows you to slide the window closed- & locked- behind it).  In the front, the grill (& center control knob) extends out into the room about 7\".  The side panels offer great privacy.  The entire unit is off-white / cream-colored / neutral.  It looks retro-designer/ mid-century, a bit industrial-looking maybe.  I've searched for 17 years, & this is by FAR the best fan I've ever found.  Worth every penny & more.  If you're on the fence, buy it!  No doubt you'll find a use for it!  PS- I believe it's generally recognized that this is the same exact item/product as the Air King brand 16\" Window Fan, which is priced much higher.  Get this Lasko while you can!", "summary": "THE SIMPLE BEST Window Fan !!!", "product_name": "Lasko #2155A Electrically Reversible Window Fan, 16 Inches", "product_id": "B00002N5Z9"}