{"rating": "4", "uuid": "251", "review_date": "2007-12-20", "helpful": "3", "reviewer_id": "A14G3AZAND93VM", "not_helpful": "3", "review_text": "This mini-prep-processor is the second Cuisinart product I have bought from Amazon. The first was a refurbished convection toaster oven. The careful engineering and attractive, simple design of both products impress me. Also impressive is how wonderfully well they work!After reading a lot of the Amazon reviews-- not all 350+-- I was convinced this mini-chopper-processor would be a better replacement for the small, inexpensive Black and Decker that burned out with no warning after one year of very mild use. Avoid Black & Decker in the kitchen is my conclusion. Anyway...this Little Honey, that's what I call him, arrived the day before Thanksgiving. Before that I'd only used the B/D to pulverize cat food twice a day. The cats spit out meat or fish pieces they'd have to chew. Waste of money, so they get instant grind instead.What good timing! I put that Little Honey right to work. The slightly larger cup capacity, two speeds, a strong sounding motor of the Cuisinart, and its crisp good looks kept inviting me to whip up quick dips, sauces and icings for unexpected company-- as well as, the morning and evening cat food.The compact size lets me keep it up on the counter. I get more use out of it than my large food processor down in the cupboards somewhere. If it were a little larger I would replace the big processor.Why only 4 stars?I think it is a great little tool, but I am waiting to see how long before the motor burns out. And 4 stars because it does not chop evenly, when I chop such chunky things as celery or certain mixtures of wet cat food large pieces are left.(No, not together! I wash it out well between food types.)Usually I run it until I smell the motor burning then stop. That is after the recommended 10 to 12 seconds, alternating between Lo and Hi speeds. Some other reviewer mentioned the burning smell also, so I assume it is normal...Anyway, if it is still doing this before the warranty runs I will have to send the Little Honey back. For now, I love it very much.", "summary": "Great Little Tool!", "product_name": "Cuisinart DLC-1 Mini-Prep Food Processor, White", "product_id": "B00000JGRP"}