{"rating": "4", "uuid": "505", "review_date": "2004-07-24", "helpful": "30", "reviewer_id": "A1L75DDQ53PXB7", "not_helpful": "31", "review_text": "I've had one for a few weeks now, and many of the positive points of this unit have been mentioned in other reviews... it's convenient, effective, and fun. You chill the aluminum cannister in your freezer until it's frozen, dump the ingredients, and start it up.I would like to address some of the negative comments about &quot;freezing power&quot; and the lack thereof.First, all home ice-cream freezers produce a soft ice cream when they are done... this is normal, and if you read the directions in nearly every ice cream recipe, they will suggest another 2-3 hours in the freezer for the ice cream you make to harden properly. Don't expect to be able to eat it immediately.If you don't remember having to wait this long in your youth, keep in mind that White Mountain / brine-based ice cream churns typically have you &quot;pack&quot; the cannister in the brine after churning. This is much faster way to harden ice cream than putting it in a normal electric freezer because the 0 degree brine is in direct contact with the sides of the ice cream cylinder and conducts heat away much more quickly than the 0 degree air in a freezer. So 15 or 20 extra minutes in the brine may do as much good as 2-3 hours in the freezer.Second, if you end up with &quot;cold soup&quot; rather than ice cream as some have complained, you have one of two problems: either you didn't chill the ingredients in the fridge prior to freezing as reccommended in the instructions, or your freezer is set too warm. A good rule of thumb is that if your freezer is set so that premium ice cream you buy at the store (like Ben & Jerry's or Haagen Dazs) is easily scoopable, it's too warm for (a) long-term food storage, and (b) chilling a cannister. Buy a thermometer and make sure that your freezer is at 0 degrees or colder.My only negative comments about the unit are that the ice cream recipes in the book that comes with it are hit-and-miss. The quick / basic vanilla is quite poor- it would be best described as &quot;vanilla extract&quot; flavored ice cream, and because the milk isn't cooked, the texture and taste are more like a frozen whipped cream. The &quot;premium chocolate&quot; is like eating a frozen truffle... we enjoyed it, but it might be too bittersweet for kids. The sherbets are under-flavored, and the frozen yogurt is extremely yogurty and unlike what you buy commercially. Fortunately, you don't have to use their recipe. I highly recommend Alton Brown's &quot;burned peach&quot; ice cream... a quick google should find it at food.com.", "summary": "Addressing the freezing power concerns", "product_name": "Cuisinart ICE-20 Automatic 1-1/2-Quart Ice Cream Maker, White", "product_id": "B00000JGRT"}