{"rating": "4", "uuid": "484", "review_date": "2004-10-11", "helpful": "204", "reviewer_id": "A2A1NHMIM8QR7T", "not_helpful": "221", "review_text": "I picked this up at the start of summer. i've made quite a few batches of ice cream. My favorites come from the Ben & Jerry cook book. There are a lot of benefits from making your own ice cream. it's cheaper. It's rewarding. It's healthier too. Even if you make the most decadent ice creams, you're still using all natural ingredients with no preservatives.There are some tricks to this machine that greatly help performance.#1 Make sure the bowl is frozen. Leave it overnight. Shake it and if anything sloshes, it's not ready.#2 Chill all ingredients. Even if the ingredients just came from the fridge, put the batter back in. I test my batter to make sure it's 35-38 degrees before starting. This will make the freezing process more gradual, which means the ice crystals will be smaller. Small crystals mean a smoother texture.#3 I let the machine work until there's little or no movement in the ice cream. This depends on how much you've got in the machine, but my recipes make the ice cream expand up above the lip of the container. When ice cream forms over the paddle and doesn't get folded back in, that's when I turn it off.#4 Let it firm up in the freezer for 4-6 hours. IT WILL BE SOFT, maybe even runny, out of the machine. I try to avoid runny, so next time either let the machine run longer or your kitchen may be too warm. Why is runny bad?  Runny is liquid and you want to try and keep air in the ice cream, so the firmer it is going in, the better. Get it in the freezer fast. Also resist the urge to pack the ice cream down, with either a utensil or by dropping it on the counter. A smooth surface may look nice, but you want to keep air in the ice cream. The air is what makes it easy to scoop and gives it a good texture.#5 Put the bowl in a plastic bag while in freezer. This keep the frost out and improves taste. Make sure it's completely dry before going back in the freezer.#6 I'd also recommend going all out and using rich cream batters. These have the least water and will have the best texture. I'd prefer one scoop of really good ice cream to 4 of a crappy sorbet.#7 Add solid stuff near the end. Wait until the last 1/2 of freezing to add your berries, chips, etc. This will help to evenly distribute stuff throughout the mixture. I like to make strawberry, so I mash my berries, drizzle in the juice, then put the mush in during the last 1/2 of the cycle.#8 Store ice cream in an air tight container with plastic wrap pushed down to the surface. I use 1.5 quart Rubbermade  containers. They fit perfectly and allow the least amount of freezer air to touch the ice cream. Fat easily obsorbs oders and can make your ice cream taste funky. You could just keep it in the bowl, but I wouldn't do that unless you plan to eat it all later that day. Plus, the sooner you get the bowl clean and back in the freezer, the sooner you can make more ice cream!I've used a GE model that had two speeds. The slower speed seemed to freeze better. I also know of some machines that have a reverse function. I would be interested in checking these out if this one ever dies.Mine came with an extra bowl, which is nice to have one always frozen.In all, a great purchase and a pretty good price. Haven't bought ice cream from the store since.", "summary": "make your own premium ice cream", "product_name": "Cuisinart ICE-20 Automatic 1-1/2-Quart Ice Cream Maker, White", "product_id": "B00000JGRT"}