{"rating": "5", "uuid": "290", "review_date": "2004-09-27", "helpful": "284", "reviewer_id": "A37CKQPJ6CJED2", "not_helpful": "294", "review_text": "A time for every seasoning......and a utensil for every purpose. The Cuisinart Mini Prep does not serve well as a primary processor for heavy jobs. That was not its intended design, or function.I obtained my first mini prep as a promotional gift with a DLC-7 purchase. For many years they have been contributing to my cooking enjoyment as a problem-free, complimentary team in a busy kitchen. When their lexan lids eventually chipped, (which admittedly is a major cause of aggravation with Cuisinart's products) I opted to replace them rather than spend up to 50% of their new cost for replacement bowls. I upgraded the old DLC-7 that is still mechanically perfect, with a MP-14 TM Limited Edition.The Mini Prep perfectly compliments larger processors. I specifically elected to stay with Cuisinart's older, boxier design; because its function is favored over the newer, sleeker model, the DLC-2ABC.The mini prep makes delectable, creamy homemade sauces and dressings. It performs equally well making pesto, cr&egrave;med butter, chopped fresh herbs, including garlic, chopped nuts, small portion purees, deviled eggs, spreads, and speedy fresh salsas. It has a fast and slow lever whose function I like because they may be \"pulsed\" on and off with an instantaneous response. This offers a demanding cook tremendous control over several types of prep functions conducive to small processors.Mini Prep seems perfectly designed to make one and a half cup portions of emulsified sauces and dressings, such as cilantro mayonnaise for grilled fish, or a dollop on fresh corn salad.Here is a basic example of how I use this workhorse.Herb mayonnaise:  place dry seasonings, a dab of honey, poupon mustard, flavored vinegars, or lemon/lime juice in the jar. Pulse to mix. Add about a tablespoon (who measures?) of Just Whites, dry pasteurized egg whites to the liquid (no cholesterol, calories, or salmonellae fears) ---pulse to mix---add a hand full of fresh herbs (cilantro, or dill, or tarragon is nice)----pulse to chop slightly. Then use the wonderfully designed lid that holds oil and has two holes on the top that will drizzle in the oil of your choice, without opening the lid, or fiddling with additional attachments that drizzle oil. You have the additional control to shift the motor speed instantaneously from high speed, to slower, or pulse mode, in direct accordance to your temperamental sauce's precise requirement as it thickens.Result: Restaurant quality chef's sauces come together effortlessly in minutes! Large processor's work bowls are too large for this type of job. One must repeatedly scrape the bowl's sides, and the motors are additionally too powerful to make small portions described above as successfully as the Mini Prep's performance.The Mini prep is very lightweight which makes it a delight to store in the pantry. It assembles and disassembles quickly and effortlessly. I especially love the function of the two (tiny) holes on the lid, along with the ease of the lid's removal for ingredient additions. The design and function permit those who love to cook an opportunity to enjoy their creativity in the kitchen without fighting with obstinate, dysfunctional appliances.It is a great convenience and a breeze to use. I love this little workhorse.", "summary": "A time for every seasoning......", "product_name": "Cuisinart DLC-1 Mini-Prep Food Processor, White", "product_id": "B00000JGRP"}