{"rating": "5", "uuid": "398", "review_date": "2010-03-27", "helpful": "4", "reviewer_id": "AYUUO2GCLMY29", "not_helpful": "4", "review_text": ":happy dance: I made real ice cream with this little machine.  I got it just recently and I've given it a go since making all the following flavors: maple nut, coffee, coffee walnut, strawberry with chocolate chunks, and mango ice cream\".  My bowel took 2 days to freeze the first time but I changed the setting on my freezer to the highest setting available and now my bowl freezes within 5 to 6 hours. Also this helps my ice cream not come out too runny. I transfer it to a container and put it in the freezer and it \"ripens\" and becomes harder consistency.  I don't have an separate recipe book. I just use the basic vanilla ice cream recipe and for the maple nut I added one cup of maple syrup but used less sugar. I added walnut bits at the end of the cycle. Oh there is no timer on this unit so you have to decide when the cycle of it churning should end. For my coffee ice cream I used theMedaglia D' Oro Instant Espresso Coffee, 2-Ounce Jars (Pack of 6)instant espresso coffee (delicious)...I used 3 spoonfuls and it was perfect in flavor. Now my strawberry ice cream, I again followed the basic vanilla ice cream recipe in the booklet that comes with the ice cream machine and I added a cup of fresh strawberries and I bought a large bar of dark chocolate which I broke up into pieces and put that in. OMG this was my best yet!!! The mango ice cream I did for my daughter because she loves Mango ice cream, again following the basic recipe I reduced the amount of sugar I put in it and added a cup of Mango nectar. So far everything has come out delicious, I freeze it in a separate container for the \"real ice cream\" consistency. This machine works perfect for the price, the amount of work, etc., you cannot go wrong.", "summary": "I'm having too much fun with this little machine!!!!", "product_name": "Cuisinart ICE-20 Automatic 1-1/2-Quart Ice Cream Maker, White", "product_id": "B00000JGRT"}