{"rating": "5", "uuid": "426", "review_date": "2008-07-19", "helpful": "3", "reviewer_id": "A2PQV2XL07X21L", "not_helpful": "3", "review_text": "Ok, I am one who will pour through hundreds of reviews before making a purchase. I had a $50 giftcard (for Macy's) and have a strict policy to only use them for something I wouldn't otherwise buy.I have wanted an ice cream maker for years. I would look at them, think about them, and ultimately put them back on the shelves as I thought it was unnecessary in the scheme of life for another small appliance in my too-small kitchen.Well, expiry was upon me with the giftcard (yes, almost 2 years) and I now live in a VERY rural area, where a trip for a container of ice cream is a 40 mile round trip. Did I mention I ADORE ice cream??I finally bought this machine. My husband thought I was crazy and that I'd never use it. Made the first batch of chocolate ice cream yesterday and let me tell you it was fantastic!This will not go unused, my husband won't allow it. We both felt it was as good or better than store purchased ice cream without the chemicals they use to keep it nice for long periods of time in the freezer. Buy your milk and cream in large containers kids, you are going to a)save a little $  and  b) make a motherload of HEALTHIER ice cream. I used half and half instead of heavy cream and it was still delightful.I am on Amazon today to buy an extra freezer container. I do think that is a bit pricey and am considering the whole reconditioned unit so that I can make two batches simultaneously. It's that good.It DOES come out soupy when initially made. It's yummy that way-I dare you to not put a spoon in the top as it's whirring around, especially the first batch. Put it in another plastic container for a couple of hours if you prefer a harder consistency.Oh, as for the noise-come on people, it's NOT that loud!My standing fan makes more noise than this thing, and I'd rather hear IT whirring knowing the sweet treat awaits me!  Honestly, maybe these folks got a faulty unit, or are particularly sensitive to noise- I don't think it's noisy at all :)Only one small note to mention. When it's done try to get it out of the canister quickly because it freezes very quickly to a very hard consistency to the sides, and it takes a bit of scraping with a wooden spoon to get it off (but I had a heck of a taste test while I completed this arduous task)  ! HAHA.Buy it and enjoy, I think folks with kids would have a lot of fun with this machine letting kids come up with their own funky flavors. I know I will.", "summary": "Better (and quieter) than expected!", "product_name": "Cuisinart ICE-20 Automatic 1-1/2-Quart Ice Cream Maker, White", "product_id": "B00000JGRT"}