{"rating": "5", "uuid": "807", "review_date": "2014-01-07", "helpful": "0", "reviewer_id": "A14CJW79M4QK8Y", "not_helpful": "0", "review_text": "The excellent instruction manual that comes with this cooker lists appropriate cooking times for many kinds of food. I really appreciate cooking brown rice in only twelve minutes and pre-soaked beans in less than that. One thing that should be understood is the safety mechanism which prevents steam from building up pressure unless the cover is closed completely as it should be. There is a cylindrical metal plug in a hole in the handle which gets pushed up by steam pressure (not talking about the central steam vent pipe capped by a heavy wobbling rocker). If the lid is not closed properly, an ingeniously designed sliding flange in the handle prevents the cylindrical plug from rising up to close the hole completely, therefore allowing steam to continuously vent out of the unsealed hole. This prevents a dangerous explosion of a loose lid. The first time I used the cooker, I did not realize that a bowl which I had placed inside to contain the rice was preventing the sliding flange from allowing the cylindrical plug to rise. When I finally realized how the flange was supposed to work, I moved the interior bowl away from the locking mechanism (after everything had cooled down, of course) and then everything worked fine. If you feel some resistance in closing the lid, don't force anything. Make sure the sliding flange is not preventing the cylindrical plug from rising. Once you see this, you will understand it without so many words.I especially enjoy the cheerful action of the central rocker (pressure regulator) when pressure builds up and steam begins to sputter out of the central vent pipe. The heavy rocker wobbles merrily reminding me of an old fashioned steam locomotive chugging along. This action informs me how much I can turn the heat down to keep on cooking without wasting water or energy.", "summary": "Cooks wonderfully fast and with a cheerful attitude", "product_name": "Presto 01341 4-Quart Stainless Steel Pressure Cooker", "product_id": "B00002N602"}