{"rating": "5", "uuid": "769", "review_date": "2007-12-19", "helpful": "2", "reviewer_id": "ACNEYVWKVXKGV", "not_helpful": "3", "review_text": "I've been using a pressure cooker ever since I was young.  Everyone in my family has one and they do last for a long time.Now, I cook professionally.  One of my valuable cooking vessel is the pressure cooker.  It takes really tough meat and make is buttery soft.  I haven't tried cooking veggies on these things, just because they are more delicate than a piece of shank.  By the way, I just ordered two for gifts.  And it made from stainless steal.One word of caution though!!!...  When cooking with this, make sure after you hear it whistle, turn down your heat to a low medium to a medium!!!..  All you want is a soft whistle.  It's compared to having a roll boil and a boiling water; it's just a waste of energy. Violent whistling means, too much pressure is building up, not good coz, the food can only take a certain pressure to still be recognizable, and the pot can only take so much pressure.  I've heard form a couple of users who neglected this \"alarm\", actually had their \"tops\" blow up.  A couple of users also reported, they actually got burned by the steam.  Also, if you have to move the pot while is hot and still whistling, do it carefully, make sure it level and place it down carefully or the pressure might burst the top off.  But, don't let this scare you!!!  Like any other tools, you have to know how to use them properly.  A knife should be used with care.  A pressure cooker!!!  A LOT of care and common sense.Tips and advice:  When cooking stews and other stuff, make sure you dont' have too much liquid or meat/veggies when cooking or you might end up with burnt food or worst, a stew geyser.  If you need to add more stuff to the pot while it is still hot and whistling; care fully place the hot pot under running cold water and cold bath and wait for the pressure to decipate.  Always clean the rubber seal coz, it does accumulate food residue.  And always, always be careful with dealing with high pressure and high heat.  Happy cooking.", "summary": "Price and Value; Just right.", "product_name": "Presto 01341 4-Quart Stainless Steel Pressure Cooker", "product_id": "B00002N602"}