{"rating": "5", "uuid": "433", "review_date": "2013-08-06", "helpful": "3", "reviewer_id": "A1HM3BW25FTY5O", "not_helpful": "3", "review_text": "I thought it was a stupid decision - to pay over $50 for an ice cream maker when I don't even care for ice cream that much.  I mean, ice cream is ok, but I rarely purchase it because I'm not crazy about it and even the \"all natural\" ones seem pretty fake to me (tara gum??? what the heck does that taste like?)  I'm a \"real food\" fan, and I like to know what's in it - even my desserts.  Anyway, I didn't hold out much hope when I got it and read the recipes that came with it - I mean, sugary milk is sugary milk (add chocolate, vanilla, etc to spice it up a bit, but no big deal, right?)  Before I made my first batch, I looked up ice cream recipes on the internet and was surprised at the differences in recipes.  Many of the highest rated ones had eggs as an ingredient.  Now we were getting somewhere - eggs add a lot of flavor if you do it right.  So, I made up my own recipe for my first batch of chocolate ice cream.  Oh! My! Gosh!  I have never, ever, ever, had ice cream that tasted so good.  It was the richest, creamiest ice cream.  My husband actually complained that he could only eat a small bowl because it was so rich.  By rich, I mean a deep chocolately flavor - sweet, but not too sweet.  My next recipe I tried (and made up) was Butter Pecan.  Oh! My! Gosh!  My adult son who says he had never had butter pecan ice cream (not sure if that's true - I'm thinking as a kid he may have tasted some) - took one bite and his eyes widened while he just about drooled all over himself - he said that was the best tasting ice cream he had ever had.  The most recent recipe I made was one of the ones in the little booklet that came with the machine - \"simple chocolate ice cream\" - and it is, in flavor and everything.  My husband loves it - because he can eat more of it (it's not rich at all).  But to me, it tastes more like flavored ice milk - it's just not creamy at all.All of the recipes that I have tried have frozen well - I don't get bricks of ice, and just a few minutes of sitting out before I scoop some out makes it really easy to do.So, I guess it wasn't a stupid decision after all - I will definitely get my money's worth out of it.  Here are my two modified recipes for the Chocolate and Butter Pecan if you want to try it for yourself:CHOCOLATE ICE CREAM:3/4 cup cocoa powder (baking cocoa), sifted1/2 cup granulated sugar1/3 cup packed dark brown sugarpinch of salt1 cup half and half2 cups heavy whipping cream3 eggs1/2 tablespoon pure vanilla extractAdd sugar (white and brown), cocoa powder, salt, half & half and heavy cream to a pot, heat over medium-low, stirring constantly, until just bubbly.  Reduce heat.  Put 3 eggs* in a bowl, blend with a fork, then slowly add some of the hot cream mixture to the eggs.  Stir, add a little more, stir - all in all, you want to blend in at least half of the cream mixture.  Then pour it all back in the pot, and slowly increase heat until it just starts to bubble.  Remove from heat, add vanilla, stir.  Cool in refrigerator several hours, then follow machine instructions.___________________________BUTTER PECAN ICE CREAM2 tablespoons butter1 cup pecan halvessalt1 cup half & half3/4 cup granulated sugar2 cups heavy whipping cream3 eggs1 tablespoon pure vanilla extractAdd sugar a pinch of salt, half & half and heavy cream to a pot, heat over medium-low, stirring constantly, until just bubbly.  Reduce heat.  Put 3 eggs* in a bowl, blend with a fork, then slowly add some of the hot cream mixture to the eggs.  Stir, add a little more, stir - all in all, you want to blend in at least half of the cream mixture.  Then pour it all back in the pot, and slowly increase heat until it just starts to bubble.  Remove from heat, add vanilla, stir.In a small skillet over medium-low heat, melt butter and add pecans.  Salt the pecans and stir constantly for several minutes to \"roast\" the nuts. (You can be doing this at the same time as making the cream mixture.)Keep cream mixture and nuts separate, and cool both in refrigerator several hours, then follow machine instructions (don't add the nuts until the very last few minutes of making the ice cream.)_____________________________*Note about eggs - I use backyard chicken eggs which I think have a lot to do with the flavor.  I'm also not concerned about salmonella from these.  I don't separate the eggs, and if you do it right, there's no need.  But one time I got side-tracked and the cream mixture got too hot after I added the eggs - which caused the whites to harden like a cooked egg.  I just skimmed the hard whites out with a slotted spoon, and briefly blended with a stick blender (like 2 second blasts) to break up any remaining.  Be careful you don't blend too long if you do this or you'll cream it too soon.__________________________Interestingly, I ordered the ice cream maker pictured here, but was shipped this one instead:Cuisinart ICE 21 Frozen Yogurt Ice Sorbet", "summary": "I never cared much for ice cream until I stupidly bought this machine", "product_name": "Cuisinart ICE-20 Automatic 1-1/2-Quart Ice Cream Maker, White", "product_id": "B00000JGRT"}