{"rating": "5", "uuid": "471", "review_date": "2006-04-06", "helpful": "10", "reviewer_id": "A3Q8WO02Y0TTYV", "not_helpful": "10", "review_text": "I am adding comments on 7/27/08 to my original from April 2006:  If I only used this machine once a year, it would deserve the space it occupies on my kitchen counter.  I probably only use it about 3-4 times a year, but I could not do without it.  I just finished making Nigella Lawson's (Food TV) Margarita ice cream.  If you have any doubts about an ice cream maker, get that recipe and try it, you'll be glad you got the ice cream machine.  Again, I recommend the Ben & Jerry's ice cream recipe book to go with it!------------------------------I never knew ice cream could be so easy.  Someone at work shared his Ben & Jerry's book with me, which inspired me to get the ice cream maker.  I love this machine.  Seemed like it used to take all afternoon to crank that hand ice cream maker (back in the day) when I was a kid, now this machine does it in under 30 minutes.  I feel like Rachel Ray!  Since half gallons of ice cream at the grocery store have gone down to 56 ounces, I'd just as soon spend my money for the ingredients to make my own.My first batch was strawberry, from the Cuisinart recipe book that came with the machine.  It was wonderful.  Just be sure to have your bowl good and frozen, one batch i had to do twice because i only left the bowl in the freezer for 18-20 hours.  Reviewer B. Pfahnl \"bpfahnl\" suggested putting a ziploc bag of ice cubes in the bowl when you have it in the freezer -- excellent suggestion.I do try making half batches since I live alone and don't need a quart and a half of ice cream at a time.  Because of the price and fat in heavy whipping cream, I use part half and half.  Still good ice cream.  And another colleague at work suggested using 1/4 cup or so of Dream Whip for smoothness.  Jury still out on that one.But it's all good.  Seems like you can't go wrong.  If you don't have one yet, hurry!  Before summer gets here and you really want a delicious bowl of homemake ice cream!", "summary": "It's great -- I love it! more than my coffeepot", "product_name": "Cuisinart ICE-20 Automatic 1-1/2-Quart Ice Cream Maker, White", "product_id": "B00000JGRT"}