{"rating": "2", "uuid": "304", "review_date": "2005-03-12", "helpful": "9", "reviewer_id": "A1CP75N61T0ZYY", "not_helpful": "9", "review_text": "This blender arrived on Friday the 11th, and is being returned on Monday, the 14th.My first suspicion came as I unpacked the blender and I noticed the base was not chrome, but in fact, plastic.  (which was not disclosed on the technical information).  The cord was thin, and only had two prongs at the end, in comparison with my old Waring blender with a very thick black cord and  3 prongs at the end for heavy duty performance.My enthusiam dampened, I put an inch of freshly peeled and thinly sliced ginger in the blender, went first topuree, then to liquify, then with no decent results went through all of the  different selections and barely got useable results.  I then put in a half of bunch of parsely, (unchopped)  read the instruction booklet, tried the selections for different speeds, and end up with chopped parsley flakes everywhere.  Unwilling to give up in spite of failed attempts, I added my berries, and applesauce. Berries, sweet, soft berries, and soft applesauce. I pureed, I liquidfied, I went through all the speeds, and ended up with bits of berries, ginger, and tons of parsely flakes everywhere and produced the worst unblended drink in my blending career.  Perhaps most people don't blend fresh ginger and parsely (so-o good for you and tasty too), but my old waring blender has been making this drink for me for years, giving me smooth pureed results each time.Hindsight being better than foresight, I realized I allowed myself to be seduced with the very nice new shape of the blender jar, thinking it would work much better than the old shape, and the new \"touch pads\" .  Wrong on both counts.  The wide shortened new shape looks great, but somehow doesn't work as well as the narrow original shape of the blending jars.  The touch pads are a pain to use, and you have to be in the right light to see if you've turned the machine on or if it's off.  I was very disappointed in the blender, but more in Cusinart, a brand I have trusted for years who makes the best food processor imaginable.  So much for trusted brands. I'm refurbishing my Waring blender with new parts, at least I know it works well.", "summary": "Major Disappointment", "product_name": "Cuisinart SPB-7 SmartPower 40-Ounce 7-Speed Electronic Bar Blender, White DISCONTINUED BY MANUFACTURER", "product_id": "B00000JGRQ"}