{"rating": "5", "uuid": "627", "review_date": "2011-08-03", "helpful": "1", "reviewer_id": "A25JF4201HQEJF", "not_helpful": "1", "review_text": "This will be my 6th Lasko 2155A Fan purchased since the year 2000.  I have kept 2 to 3 running at any given time between the months of March and November whenever possible/necessary.  This fan is one of 3 that work without flaws. We've tried to repair the others, cleaned them every year, to no avail.  Once the motor fails, that's it.  In fact, one of the first one's threw a fan blade which was quite loud.To deal with simple vibration, we devised a system involving thin strips of wood for the bottoms and 2x6s on the sides to provide a solid, semi-permanent gap fillers.  I painted the wood to match the room paint and it seems to work well.  Our windows are of the cheap variety (drywall with alum. windows wedged into place, no frames).I might have sprung for the next size up, but I couldn't afford the 100 bucks, not to mention, the motors wouldn't match up with the one's I'd purchased so far, IMO.  I just waited until amazon.com was selling this and pounced on it (due to the low price). I'm happy with these and will probably continue to purchase these if they are still made.  These fans really move the air in our house and I firmly believe they do work better when at least two are involved (one in, one on out or sometimes both on out with other windows in the house open) I'm lucky to have double doors in the \"two fans room\" that open up to allow a wide birth for the air to flow through.Small footnote: I did try ordering one from another good online store, but when that one arrived, the control knob fell off in shipment and wouldn't stay on.  Seemed cheaply made.  The one from amazon.com that arrive recently is intact and running smoothly, oddly with no vibration.UPDATE comment: as of 8/13/11 another of our fan's motors is acting up and I may have a theory about that.  Please comment to this review if you think this could be it.  I use non-aerosol hairspray (on my hair) in the room where the fan is.  Only fans that drew the air from the room were affected.  Just in the last two years we turned the fan direction to BOTH fans OUT in the room with two windows and the rest of the house windows open.  The hairspray presumably will end up being drawn up by the fans, especially the one I am standing 10 feet away from and right in line with.  In prior years, that fan was set up to allow air in, not out, for room re-circulation.  So in that case it was blowing the spray away from the fan.  However the other fan, further to the side in the second window (blowing out) was always the fan that developed motor problems; it would just bind up.  Opinions? (I have tried google.com to search for this possibility, to no avail).", "summary": "Still the best window/house fan, Great air mover", "product_name": "Lasko #2155A Electrically Reversible Window Fan, 16 Inches", "product_id": "B00002N5Z9"}