{"rating": "5", "uuid": "593", "review_date": "2011-02-20", "helpful": "7", "reviewer_id": "A1W7BIVI3O46Q", "not_helpful": "7", "review_text": "I have never spent more than maybe $10 on a fan in my life, so I was kinda antsy about buying this one, but seriously, it was absolutely worth the price for me.Let me explain my situation: My building is really old, retains a LOT of heat, and the wiring is such that tenants are only allowed to have one small window AC unit per apartment. Moving it back and forth from one side to the other is a huge pain, but it results in a sort of less-dramatic Sophie's Choice: do we leave the AC in the bedroom so we can actually sleep, or leave it in the living room/kitchen so that we can actually get things done without dying of heatstroke? So that's why I bought this fan--to help move air in the kitchen/living area and hopefully make both rooms habitable during the heat. I haven't gotten the chance to test it during a major heat wave yet (hopefully I won't NEED to *crosses fingers*) but so far, I could not be more pleased with how well it works.What I love the most about it is the versatility. It is nearly silent on the \"low\" settings, but when you set it on \"high,\" it moves a LOT of air. The fact that you can flip back and forth between intake and exhaust is really one of the selling points--it's super-handy in our combined kitchen/living room because, when my partner is cooking, we can flip it on to draw out a lot of the heat it produces. If we open up all the rooms, it helps a lot with cross-ventilation--way more than the box fan we were using previously. In addition, our old building has huge radiators which produce a TON of heat in the winter, and the exhaust function, when placed in a window near the radiator, helps a lot with keeping it from becoming too hot in here. Bonus! Basically, it does everything I hoped it would do, and a couple of things I didn't even anticipate.I also love the way it's shaped--it fits nicely in the windowframe, and has a cute retro appeal. It's front-heavy, but still quite easy to move. It's also easy to take apart and put back together for cleaning, which is a HUGE plus.My only complaints, all of which are extremely minor:-I wish it were a little flatter, just because now we can't really close the indoor shutters on that window, but that's an unusual situation (most people probably don't have those!) and I won't fault the design for it.-I'm a little concerned about the switch--it seems a bit flimsy and I'm afraid it'll break if I turn it with too much enthusiasm. But, so far, so good!-while it's pretty quiet, it does make a distinctive noise on the exhaust setting. It's a bit annoying, but if you're more than a few feet away, you can't really hear it--I've used it while napping on the couch before and not found it distracting.", "summary": "SO worth the money", "product_name": "Lasko #2155A Electrically Reversible Window Fan, 16 Inches", "product_id": "B00002N5Z9"}