[
    {
        "name": "Watson Assistant",
		"title":"Give your customers what they need, wherever they are",
		"description":"Give your customers what they need, wherever they are Watson Assistant provides customers with fast, consistent and accurate answers across any application, device or channel. Using AI, Watson Assistant learns from customer conversations, improving its ability to resolve issues the first time while removing the frustration of long wait times, tedious searches and unhelpful chatbots.",	
		"href":"https://www.ibm.com/in-en/cloud/watson-assistant",
		"tags":["alertnotif--alert-notification","api2"]
	},
	{
		"name": "Watson discovery",
		"title":"Watson Discovery is enterprise search tool",
		"description":"Watson Discovery is an award-winning enterprise search tool and AI search technology that breaks open data silos and retrieves specific answers to your questions while analyzing trends and relationships buried in enterprise data. Watson Discovery applies the latest breakthroughs in machine learning, including natural language processing capabilities, and is easily trained on the language of your domain. Unlike competitors, Watson Discovery can be deployed on any cloud or on-premises environment.",
		"href":"https://www.ibm.com/in-en/cloud/watson-discovery",
		"tags":["alertnotif--alert-notification","api2"]
	},
	{
        "name": "Analytics Engine",
		"title":"IBM Analytics Engine",
		"description":"A single Hadoop and Spark service providing an environment to develop and deploy advanced analytics applications in minutes",
		"href":"https://www.ibm.com/in-en/cloud/analytics-engine",
		"tags":["api1","api2"]
	},
	{
        "name": "Internet of Things Platform",
		"title":"What can we do for you?",
		"description":"What can we do for you? We are a fully managed, cloud-hosted service that is designed to simplify and derive the value from your IoT devices.",
		"href":"https://internetofthings.ibmcloud.com/",
		"tags":["alertnotif--alert-notification","api2"]
	},
	{
        "name": "Twilio Authy",
		"title":"Twilio Authy",
		"description":"Authy delivers a robust API and app that helps you secure users and future proof your business.",
		"href":"https://www.twilio.com/authy",
		"tags":["api1","alertnotif--alert-notification"]
	},
	{
        "name": "Twilio Verify",
		"title":"Twilio Verify",
		"description":"Fight fraud before it starts. Validate users with SMS, Voice, Email, and Push.",
		"href":"https://www.twilio.com/verify",
		"tags":["api1","api2"]
	},
	{
        "name": "Cloudant",
		"title":"IBM Cloudant",
		"description":"The data layer for hyperscale, resilient, globally available applications, based on open source Apache CouchDB",
		"href":"https://www.ibm.com/in-en/cloud/cloudant",
		"tags":["api1","api2"]
	},
	{
        "name": "DB2",
		"title":"IBM Db2",
		"description":"Transform and modernize your data management with AI-driven solutions",
		"href":"https://www.ibm.com/in-en/analytics/db2",
		"tags":["api1","api2"]
	}
]
